; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s1-p26-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l1-0 l2-0 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (OBJ p22)
    (OBJ p23)
    (OBJ p24)
    (OBJ p25)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at p0 l0-0)
    (at p1 l0-0)
    (at p2 l2-0)
    (at p3 l1-0)
    (at p4 l1-0)
    (at p5 l1-0)
    (at p6 l0-0)
    (at p7 l1-0)
    (at p8 l2-0)
    (at p9 l0-0)
    (at p10 l0-0)
    (at p11 l2-0)
    (at p12 l2-0)
    (at p13 l1-0)
    (at p14 l1-0)
    (at p15 l2-0)
    (at p16 l2-0)
    (at p17 l2-0)
    (at p18 l1-0)
    (at p19 l1-0)
    (at p20 l0-0)
    (at p21 l2-0)
    (at p22 l1-0)
    (at p23 l2-0)
    (at p24 l2-0)
    (at p25 l2-0)
    (at a0 l0-0)
)
(:goal
    (and
        (at p0 l0-0)
        (at p1 l1-0)
        (at p2 l1-0)
        (at p3 l1-0)
        (at p4 l2-0)
        (at p5 l1-0)
        (at p6 l2-0)
        (at p7 l1-0)
        (at p8 l1-0)
        (at p9 l2-0)
        (at p10 l2-0)
        (at p11 l0-0)
        (at p12 l2-0)
        (at p13 l2-0)
        (at p14 l1-0)
        (at p15 l2-0)
        (at p16 l1-0)
        (at p17 l2-0)
        (at p18 l2-0)
        (at p19 l1-0)
        (at p20 l0-0)
        (at p21 l2-0)
        (at p22 l1-0)
        (at p23 l0-0)
        (at p24 l1-0)
        (at p25 l0-0)
    )
)
)

; plan
1. (load-airplane p9 a0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 a0)
   goals met: 12 of 26
2. (load-airplane p6 a0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 12 of 26
3. (load-airplane p10 a0 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a0)
   goals met: 12 of 26
4. (load-airplane p1 a0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a0)
   goals met: 12 of 26
5. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 12 of 26
6. (unload-airplane p9 a0 l2-0)
   deleted: (in p9 a0)
   added: (at p9 l2-0)
   goals met: 13 of 26
7. (load-airplane p8 a0 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 a0)
   goals met: 13 of 26
8. (unload-airplane p6 a0 l2-0)
   deleted: (in p6 a0)
   added: (at p6 l2-0)
   goals met: 14 of 26
9. (load-airplane p25 a0 l2-0)
   deleted: (at p25 l2-0)
   added: (in p25 a0)
   goals met: 14 of 26
10. (load-airplane p24 a0 l2-0)
   deleted: (at p24 l2-0)
   added: (in p24 a0)
   goals met: 14 of 26
11. (load-airplane p23 a0 l2-0)
   deleted: (at p23 l2-0)
   added: (in p23 a0)
   goals met: 14 of 26
12. (load-airplane p2 a0 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 a0)
   goals met: 14 of 26
13. (load-airplane p16 a0 l2-0)
   deleted: (at p16 l2-0)
   added: (in p16 a0)
   goals met: 14 of 26
14. (load-airplane p11 a0 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 a0)
   goals met: 14 of 26
15. (unload-airplane p10 a0 l2-0)
   deleted: (in p10 a0)
   added: (at p10 l2-0)
   goals met: 15 of 26
16. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 15 of 26
17. (unload-airplane p25 a0 l0-0)
   deleted: (in p25 a0)
   added: (at p25 l0-0)
   goals met: 16 of 26
18. (unload-airplane p23 a0 l0-0)
   deleted: (in p23 a0)
   added: (at p23 l0-0)
   goals met: 17 of 26
19. (unload-airplane p11 a0 l0-0)
   deleted: (in p11 a0)
   added: (at p11 l0-0)
   goals met: 18 of 26
20. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 18 of 26
21. (unload-airplane p8 a0 l1-0)
   deleted: (in p8 a0)
   added: (at p8 l1-0)
   goals met: 19 of 26
22. (load-airplane p4 a0 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a0)
   goals met: 19 of 26
23. (unload-airplane p24 a0 l1-0)
   deleted: (in p24 a0)
   added: (at p24 l1-0)
   goals met: 20 of 26
24. (unload-airplane p2 a0 l1-0)
   deleted: (in p2 a0)
   added: (at p2 l1-0)
   goals met: 21 of 26
25. (load-airplane p18 a0 l1-0)
   deleted: (at p18 l1-0)
   added: (in p18 a0)
   goals met: 21 of 26
26. (unload-airplane p16 a0 l1-0)
   deleted: (in p16 a0)
   added: (at p16 l1-0)
   goals met: 22 of 26
27. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 22 of 26
28. (unload-airplane p1 a0 l1-0)
   deleted: (in p1 a0)
   added: (at p1 l1-0)
   goals met: 23 of 26
29. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 23 of 26
30. (unload-airplane p4 a0 l2-0)
   deleted: (in p4 a0)
   added: (at p4 l2-0)
   goals met: 24 of 26
31. (unload-airplane p18 a0 l2-0)
   deleted: (in p18 a0)
   added: (at p18 l2-0)
   goals met: 25 of 26
32. (unload-airplane p13 a0 l2-0)
   deleted: (in p13 a0)
   added: (at p13 l2-0)
   goals met: 26 of 26
